Repository: amro-baira23/Pharmacy-Managment
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: undifained user type
ar: نوع مستخدم غير معروف

source: cant have dublicate in this array
ar: كل عنصر يمكن أن يوجد مرة واحدة

source: medicine with this data already exist
ar: يوجد دواء بمثل هذه البيانات بالفعل

source: you must enter a date in the present
ar: على تاريخ الصلاحية أن يكون في المستقبل

source: cant update medicine , with same data already exist
ar: فشل التحديث يوجد بالفعل دواء بالصفات المدخلة

source: no medicine with such id for this pharmacy
ar: لا يوجد دواء بهذا الرقم لهذه الصيدلية

source: not enough medicine %(name)s in enventory
ar: في الصيدلية %(name)s لا يوجد مايكفي من

source: sale should have atleast one item
ar: على الطلب أن يحوي عنصر واحد على الأقل

source: cant delete a medicine which sold once but you can archive it
ar: لا يمكن حذف دواء تم بيعه سابقا يمكنك القيام بأرشفته عوضا عن ذلك

source: phone_number
ar: رقم الهاتف

source: pharmacy
ar: صيدلية

source: company
ar: شركة

source: some items are invalid
ar: بعض العناصر غير صالحة

source: sale item should be dict
ar: على العنصر المباع أن يكون قاموس

source: item should have have medicine quantity expiry-date and price only
ar: على العنصر المباع أن يحوي سعر وكمية وتاريخ صلاحية ودواء محدد

source: item should have have medicine quantity and price only
ar: على العنصر أن يحوي سعر وكمية ودواء محدد

source: same item with diffrent price or expiry_date exist
ar: يوجد دواء مكرر بسعر او بتاريح صلاحية مختلف ضمن الطلب

source: salry
ar: الراتب

source: role
ar: الدور
